heros-backend/app/controllers/heros_controller.rb

SELECT "heros".* FROM "heros"
---
  def index
    @heros = Hero.all

SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show
    @hero = Hero.find(params[:id])

INSERT INTO "heros" ("name", "super_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Spencer Austin "], ["super_name", "Speedy"], ["created_at", "2020-07-22 03:18:16.915321"], ["updated_at", "2020-07-22 03:18:16.915321"]]
---
  def create
    @hero = Hero.create(
      name: params[:name],
      super_name: params[:super_name]
    )